app/views/recipes/index.html.erb

SELECT "tags".* FROM "tags" INNER JOIN "recipes_tags" ON "tags"."id" = "recipes_tags"."tag_id" WHERE "recipes_tags"."recipe_id" = $1  [["recipe_id", 1]]
---
    	      <h4> Tags: </h4>
    	        <h4><% recipe.tags.each do |tag| %>

SELECT "recipes".* FROM "recipes" INNER JOIN "recipes_tags" ON "recipes"."id" = "recipes_tags"."recipe_id" WHERE "recipes_tags"."tag_id" = $1  [["tag_id", 3]]
---
          <% @tag_results.each do |tag| %>
            <% tag.recipes.each do |recipe| %>