app/views/recipes/show.html.erb

SELECT "tags".* FROM "tags" INNER JOIN "recipes_tags" ON "tags"."id" = "recipes_tags"."tag_id" WHERE "recipes_tags"."recipe_id" = $1  [["recipe_id", 1]]
---

<h3> Tags: <% @recipe.tags.each do |tag| %>