app/views/tags/show.html.erb

SELECT "recipes".* FROM "recipes" INNER JOIN "recipes_tags" ON "recipes"."id" = "recipes_tags"."recipe_id" WHERE "recipes_tags"."tag_id" = $1  [["tag_id", 5]]
---

<h3> <% @tag.recipes.each do |recipe| %>