app/controllers/recipes_controller.rb

INSERT INTO "recipes" ("name", "ingredients", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Pasta"], ["ingredients", "Pasta and Sauce"], ["created_at", "2015-01-26 19:12:40.392514"], ["updated_at", "2015-01-26 19:12:40.392514"]]
---
  def create
    @recipe = Recipe.new(params[:recipe])
    if @recipe.save

SELECT  "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "recipes" SET "ingredients" = $1, "updated_at" = $2 WHERE "recipes"."id" = $3  [["ingredients", "Broccoli, olive oil, cooking pan"], ["updated_at", "2015-01-26 15:26:19.815588"], ["id", 1]]
---
  def update
    @recipe = Recipe.find(params[:id])
    if @recipe.update(:number => params[:number],
                      :name => params[:name],
                      :text => params[:text])