app/controllers/star_ratings_controller.rb

  def create
    recipe = Recipe.find(params[:recipe_id])
    @star_rating= StarRating.new(params[:star_rating])
    @star_rating.save
---
SELECT  "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 LIMIT 1  [["id", 1]]
INSERT INTO "recipes_star_ratings" ("recipe_id", "star_rating_id") VALUES ($1, $2) RETURNING "id"  [["recipe_id", 1], ["star_rating_id", 1]]
INSERT INTO "star_ratings" ("rating", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["rating", 3], ["created_at", "2015-01-22 21:48:15.698570"], ["updated_at", "2015-01-22 21:48:15.698570"]]