app/controllers/tags_controller.rb

SELECT  "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 LIMIT 1  [["id", nil]]
INSERT INTO "tags" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "cool"], ["created_at", "2015-01-21 21:49:09.927235"], ["updated_at", "2015-01-21 21:49:09.927235"]]
---
  def create
    recipe = Recipe.find(params[:recipe_id])
    @tag= Tag.new(params[:tag])
    @tag.save

SELECT  "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 LIMIT 1  [["id", 3]]
SELECT "tags".* FROM "tags"
SELECT  "tags".* FROM "tags" WHERE "tags"."id" = $1 LIMIT 1  [["id", nil]]
INSERT INTO "tags" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", "2015-01-26 19:45:21.706445"], ["updated_at", "2015-01-26 19:45:21.706445"]]
---
  def update
    recipe = Recipe.find(params[:recipe_id])
    @tags = Tag.all
    @tag= Tag.find(params[:id])
    @tag.save
    @tag.recipes << recipe